# Modern CLI replacements
brew "eza"            # Modern ls replacement
brew "bat"            # Better cat with syntax highlighting
brew "zoxide"         # Smarter cd command
brew "fnm"            # Fast Node.js version manager
brew "trash"          # Safe alternative to rm
brew "fzf"            # Fuzzy finder
brew "git-delta"      # Better git diffs
brew "gh"             # GitHub CLI

# Search and processing tools
brew "ripgrep"        # Fast grep replacement
brew "fd"             # User-friendly find replacement
brew "tree"           # Directory tree view
brew "tldr"           # Simplified man pages

# System monitoring and debugging
brew "btop"           # System monitor
brew "httpie"         # User-friendly curl alternative

# Development tools
brew "shellcheck"     # Shell script analysis tool
